import os
import django

os.environ.setdefault("DJANGO_SETTINGS_MODULE", "message_notifier.settings")
django.setup()

from users.models import User
from notifications.manager import NotificationManager
from notifications.senders.email import EmailSender
from notifications.senders.telegram import TelegramSender
from notifications.senders.sms import SMSSender


def run_test():
    """
    Функция для тестовой отправки уведомлений пользователю. Предназначена
    для локального тестирования работы системы уведомлений - для быстрой
    проверки изменений без пересборки DOCKER-образа.

    Последовательность действий:
        1. Проверяет наличие хотя бы одного пользователя в базе (его можно создать через
        POST-запрос на эндпроинт api/users/create/). Можно было бы создать его прям в
        функции, но тогда нужно будет хранить конфиденциальные данные в коде, а это неприемлимо.
        2. Использует первого найденного пользователя.
        3. Инициализирует отправителей уведомлений: Email, Telegram, SMS.
        4. Создает NotificationManager с указанными отправителями.
        5. Отправляет тестовое сообщение через все каналы.
        6. Выводит результаты отправки в консоль.

    Особенности:
        - Если в базе нет пользователей, функция выводит предупреждение и завершает выполнение.
        - Сообщения отправляются синхронно, результаты отображаются сразу после отправки.
        -
    """
    print("=== Запуск тестовой отправки уведомлений ===")
    user = User.objects.first()
    if not user:
        print("❌ Нет ни одного пользователя в базе."
              " Создай через эндпроинт api/users/create/"
              )
        return

    print(f"Используется пользователь: {user.email}")

    email_sender = EmailSender()
    telegram_sender = TelegramSender()
    sms_sender = SMSSender()

    notifier = NotificationManager([
        email_sender,
        telegram_sender,
        sms_sender
    ])

    message = "Тестовое сообщение: система уведомлений работает 😎"

    print("Отправка…")
    results = notifier.notify(user, message)

    print("\n=== Результаты ===")
    for sender, result in results.items():
        print(f"{sender}: {result}")


if __name__ == "__main__":
    run_test()
